{
  "title": "Reporting Data Corrector",
  "id": "76384490",
  "content": "<h2><span style=\"color: rgb(0,128,128);\">Where the Tool Lives</span></h2><p><span style=\"color: rgb(0,0,0);\">Payment Ops &gt; Tools &gt; Reporting Data Corrector&nbsp;<strong>OR</strong></span></p><p><span style=\"color: rgb(0,0,0);\"><a href=\"https://app.gusto.com/panda/reporting_data_corrector\">https://app.gusto.com/panda/reporting_data_corrector</a></span></p><p><span style=\"color: rgb(0,0,0);\"><ac:image ac:class=\"cc_cursor\" ac:height=\"400\"><ri:attachment ri:filename=\"Screen Shot 2020-02-24 at 3.34.42 PM.png\" /></ac:image></span></p><p><span style=\"color: rgb(0,0,0);\"><br /></span></p><p><span style=\"color: rgb(0,0,0);\"><br /></span></p><h2><span style=\"color: rgb(0,128,128);\">What are we solving for?</span></h2><p><span style=\"color: rgb(0,0,0);\">Our reporting system sometimes has incorrect reporting information, which leads to unreconciled bank transactions. We will be able to use this tool to fix specific transaction reporting, which will help reduce unreconciled bank transactions. Currently the tool supports the editing of Electronic Payments and Check Payments. Sometimes the amount of an Electronic Payment don't match the amount of a Bank Transaction. There can be multiple reasons as to why this is the case, such as a possible over/underpayment or the Electronic Payment is missing an Electronic Entry. We are able to edit the amount on the Electronic Payment to match the amount on the agent payment.&nbsp;</span></p><p><span style=\"color: rgb(0,0,0);\"><br /></span></p><h2><span style=\"color: rgb(0,128,128);\">How do we solve this?</span></h2><p><span style=\"color: rgb(0,0,0);\">EX: We have a bank transaction for HAB-EIT for&nbsp;$360,696.85 and a corresponding electronic payment for&nbsp;$361,241.26. We know that this is caused because we get a discount from this agency for an early electronic payment. The $544.41 difference needs to be accounted for, otherwise the bank transaction will remain unreconciled.&nbsp;</span></p><p><span style=\"color: rgb(0,0,0);\"><a href=\"https://app.gusto.com/panda/bank_transactions/5433338\">https://app.gusto.com/panda/bank_transactions/5433338</a></span></p><p><span style=\"color: rgb(0,0,0);\"><a href=\"https://app.gusto.com/panda/electronic_payments/508372\">https://app.gusto.com/panda/electronic_payments/508372</a></span></p><p><br /></p><h2><span style=\"color: rgb(0,128,128);\">Existing Electronic Payment</span></h2><h3><span style=\"color: rgb(0,0,0);\">Step 1:</span></h3><p><span style=\"color: rgb(0,0,0);\"><ac:image ac:height=\"400\"><ri:attachment ri:filename=\"Screen Shot 2020-02-24 at 4.11.27 PM.png\" /></ac:image></span></p><p><span style=\"color: rgb(0,0,0);\">Insert the bank transaction ID of the unreconciled bank transaction into the search box. Once we find the desired bank transaction, we can move on to the next step.</span></p><p><span style=\"color: rgb(0,0,0);\"><br /></span></p><h3><span style=\"color: rgb(0,0,0);\">Step 2:</span></h3><p><ac:image ac:height=\"400\"><ri:attachment ri:filename=\"Screen Shot 2020-02-24 at 4.29.44 PM.png\" /></ac:image></p><p><span style=\"color: rgb(0,0,0);\">Since we already have an existing corresponding Electronic Payment. We can search up the ID and move on to the next step.&nbsp;</span></p><p><span style=\"color: rgb(0,0,0);\"><br /></span></p><h3><span style=\"color: rgb(0,0,0);\">Step 3:</span></h3><p><span style=\"color: rgb(0,0,0);\"><ac:image ac:width=\"900\"><ri:attachment ri:filename=\"Screen Shot 2020-02-24 at 4.33.18 PM.png\" /></ac:image></span></p><p><span style=\"color: rgb(0,0,0);\">This is the step that we're able to edit the payment. There is a search box where we can filter by agent payment ID. The three vertical dots on the right give us the option to edit the selected agent payment amounts or delete it from the agent payment list. We can also add any additional agent payments to this Electronic Payment if it's not included in the original Electronic Payment. In this particular case, since we know the difference is not due to any particular company, but is actually a discount issued to us by the agency, we're able to keep it as unattributable funds.&nbsp;</span></p><p><span style=\"color: rgb(0,0,0);\">Any amount left in unattributable funds is an amount that we're unable to attribute to any liability/were not accounted for when we made the payment.&nbsp;</span></p><p><span style=\"color: rgb(0,0,0);\"><ac:image ac:width=\"400\"><ri:attachment ri:filename=\"Screen Shot 2020-02-24 at 4.43.15 PM.png\" /></ac:image></span></p><p><span style=\"color: rgb(0,0,0);\">If there are any remaining funds in the Unattributable amount, there is a mandatory comment box at the bottom of this page.</span></p><p><span style=\"color: rgb(0,0,0);\"><br /></span></p><h3><span style=\"color: rgb(0,0,0);\">Step 4:</span></h3><p><span style=\"color: rgb(0,0,0);\"><ac:image ac:height=\"250\"><ri:attachment ri:filename=\"Screen Shot 2020-02-24 at 4.45.36 PM.png\" /></ac:image></span></p><p><span style=\"color: rgb(0,0,0);\">This step is a final review of our work thus far. Since we're confident about having an unattributable amount here, we can go ahead and submit this change.</span></p><p><br /></p><h2><span style=\"color: rgb(0,128,128);\">Create New Electronic Payment</span></h2><p>EX: HI UI payment. Bulk electronic payment, but multiple bank transactions. We need to create a new Electronic Payment and remove the electronic entries from the original electronic payment.</p><p><br /></p><h3>Step 1:</h3><p><ac:image ac:height=\"400\"><ri:attachment ri:filename=\"Screen Shot 2020-02-27 at 2.26.40 PM.png\" /></ac:image></p><p>I took the BT that I want to create a new EP for.</p><p><br /></p><h3>Step 2:</h3><p><ac:image ac:height=\"400\"><ri:attachment ri:filename=\"Screen Shot 2020-02-27 at 2.27.50 PM.png\" /></ac:image></p><p>Select create new electronic payment. Click on the add agent payment box and add agent payment ID.</p><p><br /></p><h3>Step 3:</h3><p><ac:image ac:width=\"1000\"><ri:attachment ri:filename=\"Screen Shot 2020-02-27 at 2.28.55 PM.png\" /></ac:image></p><p>Review that this is the agent payment you want to create a brand new EP for. Hit the submit button when you're ready.</p><p><br /></p><h2><span style=\"color: rgb(0,128,128);\">Create Check Payment Transmission</span></h2><p>The tool knows when to switch to Create/Use Existing check payment, when working with a Check Paid bank transaction. To create a new check payment transmission you just use the tool on a check paid bank transaction and select Create Check Payment.</p><ol><li>Input the check number<ol><li><strong>If this is a MasterTax agency, you need to make sure that this check number exists on MasterTax. The system will use this number to search for the address of the agency.</strong><ol><li>For a bulk check: put the check number for any of the checks that are part of the bulk check in.</li><li>If the deposit was re-opened, and the old check was not voided, then you need to put in the check number of the old check. Daniel or anyone from P&amp;F has the ability to switch the check number with a rake task, so message them if you want the check number to be switched to the correct number.</li></ol></li><li>If it's a PF agency, then it can just be any check number as it wont need to go through MasterTax to look for the agency address.</li></ol></li><li>Add the agent payment that you want to associate to the check.</li><li>Edit the amount if it needs to be edited.</li><li>And Create the Check Payment</li></ol><p>To create a bulk check, best practice would be to void all existing check payment transmissions that are associated to the bulk check. You will be creating more with this tool, and you don't want a period where the agent payment is overpaid. Once all the checks are voided, then you can use the create check payment flow to add all of the agent payments (separated by a comma) to the new transmission. When you want to input a check number, just take a random check number that's on MasterTax of one of the check payments that you voided earlier. This is just a place holder check number, to make the bulk check. Once the check payment transmission has been created and reconciled, then you can ask P&amp;F to change the check number to the actual check number that was cashed.&nbsp;</p><h2><span style=\"color: rgb(0,128,128);\">Existing Check Payment Transmission</span></h2><p>You can use this flow to edit existing check payment transmissions. I would use this if you wanted to edit an amount of a particular check payment. You would need to input the check payment ID into the search box and the system will then pull up all associated agent payments to that check payment ID. Here you can edit the amounts as need be.&nbsp;</p><p><br /></p><h2><span style=\"color: rgb(0,128,128);\">Edge Cases with no support</span></h2><p>Fully unattributable payment</p><p>No agent payment (if it's standalone, but if it's part of a larger electronic payment, then you can set it as unattributable)&nbsp;</p><h2><span style=\"color: rgb(0,128,128);\">Use Cases</span></h2><p><span style=\"color: rgb(0,0,0);\">Microvariance</span></p><p>possible draft agent payment</p><p>overpayment/underpayment</p><p>Unattributable credit to a bulk payment</p><p>Bulk electronic payment - multiple bank transactions</p>",
  "url": "https://gustohq.atlassian.net/wiki/spaces/PlatformOperations/pages/76384490"
}