{
  "title": "Aged Bank Transactions",
  "id": "169411605",
  "content": "<p>Any bank transaction that occurred in a previous Gusto financial quarter is considered 'aged'.&nbsp; Changing the status of an aged bank transaction has the potential to impact Gusto's financial reporting. So we've created the following polices so Gusto's platform accounting team is aware of and/or approves any changes to aged bank transactions.&nbsp;</p><h1>Previous quarter within current fiscal year</h1><p>If we need to un-reconcile/re-reconcile a transaction in the previous quarter (but in the current fiscal year), please follow the below steps based on the dollar amount:</p><ul><li><p>Any amounts <strong>less</strong> than $10k</p><ul><li><p>Email <a href=\"mailto:platform-accounting@gusto.com\">platform-accounting@gusto.com</a> but due to the amount,<span style=\"color: rgb(60,64,67);\">&nbsp;no details need to be shared. The email should just say something to the effect of 'no material changes in the previous quarter...'</span></p></li></ul></li><li><p>Any amounts <strong>greater</strong> than $10k</p><ul><li><p>Email <a href=\"mailto:platform-accounting@gusto.com\">platform-accounting@gusto.com</a> with details on why the transaction needs to be reconciled</p><ul><li><p>Include details such as the bank transaction link, dollar amount, date, detailed reason for unreconciling/reconciling&nbsp;</p></li></ul></li></ul></li></ul><h1>Previous fiscal year</h1><p>If we need to un-reconcile/re-reconcile a transaction from the previous year, please follow the steps below:</p><ul><li><p>Please email Haewon Han (<a href=\"mailto:haewon.han@gusto.com\">haewon.han@gusto.com</a>) and cc <a href=\"mailto:platform-accounting@gusto.com\">platform-accounting@gusto.com</a> and <a href=\"mailto:platform_ops@gusto.com\">platform_ops@gusto.com</a> </p></li><li><p>Provide details in your email on which transactions need to be unreconciled and/or re-reconciled</p></li><li><p>Include the dollar amount, date, detailed reason for unreconciling/rereconciling, and the expected outcome</p></li><li><p>Once Accounting gives the approval to do so and the process is complete, please unlock the transaction, re-reconcile it, and respond to the email with the final outcome of the transaction</p></li></ul><p /><h1>How to Unlock Previous Fiscal Year Transactions/Update Business Value</h1><ol start=\"1\"><li><p>&nbsp;Use this business value using this <a href=\"https://app.gusto.com/panda/business_values/356/edit\">link</a>, and edit the business value date to the date of the transaction you're trying to reconcile.&nbsp;</p><ol start=\"1\"><li><p><strong>Please do NOT uncheck the admin groups, only edit the date</strong></p></li></ol></li><li><p>Once this has been updated, you'll need to go the approval page here: <a href=\"https://app.gusto.com/panda/approvals\">https://app.gusto.com/panda/approvals</a></p><ol start=\"1\"><li><p>This page contains&nbsp;<em>all</em> approvals in the system. If you don't locate the approval immediately, it might can be difficult to page through the results if more approvals have been generated in the meantime.</p></li><li><p>You can also use this &quot;Reconciliation Date Business Value - Approval Link for Payment Ops&quot; query to locate the approval link: <a href=\"https://redash.zp-int.com/queries/78860/source\">https://redash.zp-int.com/queries/78860/source</a> (requires access to &quot;ZP Read Replica - Payment Ops&quot; data source)</p></li><li><p>Locate the approval with your&nbsp;<strong>name</strong> on it. The approval will be in &quot;pending&quot; status.</p></li></ol></li><li><p>Tag the <strong>@payment-ops reconciliation</strong> handle in the <strong>#payment-ops-recon</strong> channel to have someone approve your change</p><ol start=\"1\"><li><p>Approver:</p><ol start=\"1\"><li><p>If the new date is incorrect, &quot;reject&quot; the approval and have the person edit the Business value again in order to generate a fresh approval link. The old approval will update to &quot;rejected&quot; status.</p></li><li><p>Once approved, the approval will update to &quot;approved&quot; status.</p></li></ol></li></ol></li><li><p>Once you've reconciled the transaction, you'll need to go back to the <a href=\"https://app.gusto.com/panda/business_values/356/edit\">business value link</a> and change it back to<strong> 2023-05-01</strong> (repeat Step 1)</p></li><li><p>Use the same thread where you tagged the recon handle team and have someone approve your change again <ac:emoticon ac:name=\"smile\" ac:emoji-id=\"1f642\" /> (repeat Steps 2-3)</p><ol start=\"1\"><li><p>Approver:</p><ol start=\"1\"><li><p>If the new date is incorrect, &quot;reject&quot; the approval and have the person edit the Business value again in order to generate a fresh approval link.</p></li></ol></li></ol></li></ol><p><strong>And that's it!</strong></p><p /><p><u>This is important because if Gusto becomes a public company, we need to file a form to restate our numbers if we make any changes to the prior year's number since we are editing financial data that is public!</u></p><p />",
  "url": "https://gustohq.atlassian.net/wiki/spaces/PlatformOperations/pages/169411605"
}