{
  "title": "End of Quarter Issues",
  "id": "169411096",
  "content": "<h2>IL UI / Other EFT Debit Agencies (ACH External)</h2><h3>Issue:</h3><p>During the End of Quarter (EoQ) period, IL UI will typically be an agency that will be unreconciled. There can be many different reasons as to the root cause, but the solution depends on a few different factors.&nbsp;</p><ol start=\"1\"><li><p>Are there transmissions that exist for these BTs but they aren't reconciled due to a difference in amount? (microvariance)</p></li><li><p>Are the agent payments for these BTs still in draft mode?&nbsp;</p></li></ol><h3>Solution:</h3><ol start=\"1\"><li><p>Run the <ac:link><ri:page ri:content-title=\"Microvariance Adjuster Tool\" ri:version-at-save=\"4\" /><ac:link-body>/wiki/spaces/PlatformOperations/pages/76385735</ac:link-body></ac:link></p><ol start=\"1\"><li><p>&nbsp;Then run the <ac:link><ri:page ri:content-title=\"Run Reconciler SOP for Electronic Payments\" ri:version-at-save=\"1\" /><ac:link-body>/wiki/spaces/PlatformOperations/pages/169411456</ac:link-body></ac:link></p></li></ol></li><li><p>If the Run Reconciler tool does not capture all transactions, you can repeat the steps and adjust your date parameters as necessary</p><ol start=\"1\"><li><p>Note: Please be intentional when setting the dates on both tools to ensure we're not manipulating data on other transmissions</p></li></ol></li></ol><h2>OK UI</h2><h3>Issue:&nbsp;</h3><p>OK UI shows up on our BAI file as individual bank transactions. Our system creates a bulk EP, which won't auto-reconcile to the multiple BTs. You'll need to use the many BTs to one transmission reconciliation that exists on the EP panda page.&nbsp;</p><h3>Solution:</h3><p>Sometimes the system will auto-reconcile some of the OK UI BTs to an incorrect EP such as IL UI. Here is a <a href=\"https://redash.zp-int.com/queries/39636/source\">query</a> that will show all OK UI bts with the BAI file IDs and inputs. You'll need to comment in &quot;SUM(bt.amount*.01)&quot; to figure out if the all the BTs on the desired BAI file equal the amount of the EP. If the amounts are off, it can be that some of the transactions are on other BAI files OR that they're reconciled incorrectly to other EPs. You can change the line &quot;AND <a href=\"http://r.id\">r.id</a> IS NULL&quot; to &quot;AND <a href=\"http://r.id\">r.id</a> IS <strong>NOT</strong> NULL&quot; in order to show BTs on the BAI file that are reconciled.&nbsp;</p><p>If all the BTs add up to the EP, then you can comment back in the line &quot;CONCAT(<a href=\"http://bt.id\">bt.id</a>,',')&quot; which will add a comma after each <a href=\"http://BT.id\">BT.id</a>. You can download the csv, open it, and then copy the column with all the BT.ids with commas. You can then paste that in the reconciliation box on the EP.&nbsp;</p><p><strong><span style=\"background-color: rgb(254,222,200);\">Note: OK UI reconciliation issues have been resolved! We are no longer seeing issues with this agency as Pufferfish Eng was able to change sending the filings from bulk &rarr; individual. As a result, OK UI will now be auto-reconciled as 1 BT &rarr; 1 EP as opposed to the previous flow of many BTs &rarr; 1 EP</span></strong><br /><br /></p><h2>WA ESD</h2><h3>Issue:&nbsp;</h3><p>Tax Ops will sometimes file amendments for WA ESD during EOQ - the amounts are sometimes sent out individually and we'll see the individual BTs, but the electronic payment is a bulk payment.</p><h3>Solution:</h3><p>The agency owner usually creates PAYMENTS JIRA tickets under &quot;Tax Ops/Res Only Reconciliation&quot; issue type (example ticket): <a href=\"https://gustohq.atlassian.net/browse/PAYMENTS-16033\">https://gustohq.atlassian.net/browse/PAYMENTS-16033</a><br /><br />You will be able to see the individual payments on the sheet and reconcile accordingly - please cross reference the amount on the bank transactions with the amendment sheet to ensure that this is the related issue. If you're unable to locate it on this sheet AND cannot locate the agent payment and/or electronic payment, please surface this to #payment-people and tag the agency owner for assistance.</p><p /><h2>York Adams (LST &amp; EIT)</h2><h3>Issue:&nbsp;</h3><p>Currently, York Adams has two agencies (York Adams LST &amp; York Adams EIT). Our system creates a separate bulk EP for LST &amp; EIT filings, however the agency debits the payments individually and as a result, manual reconciliation is needed to reconcile the transactions as many BT &rarr; one EP. All bank transactions related to<strong> LST</strong> will have a description starting as &ldquo;<strong>LE&rdquo;</strong> an<strong>d EIT </strong>will have a description starting as &ldquo;<strong>EE</strong>&rdquo;</p><ul><li><p>EIT example: <a href=\"https://app.gusto.com/panda/electronic_payments/4543234\">https://app.gusto.com/panda/electronic_payments/4543234</a></p></li><li><p>LST example: <a href=\"https://app.gusto.com/panda/electronic_payments/4477653\">https://app.gusto.com/panda/electronic_payments/4477653</a></p></li></ul><p /><h3>Solution:</h3><p>Identify bank transactions that have an LE description and EE description by putting all York Adams bank transactions on a Google sheet, and then sort from A &rarr; Z. This is the easiest way to sort by bank description so you can differentiate which transactions are LST and EIT. Once this is complete, add up all transactions that have an <strong>LE description for York Adams LST</strong> and it should be the total amount of the bulk EP (<strong>do the same for EE for York EIT</strong>). You should be able to reconcile this as many BTs &rarr; 1 EP.<br /><br /><span style=\"background-color: rgb(254,222,200);\">Note: I have requested Pufferfish Eng to change the filings for bulk EP &rarr; individual filings (just like OK UI&rsquo;s fix)! Will update here once the fix has been implemented.</span></p><p />",
  "url": "https://gustohq.atlassian.net/wiki/spaces/PlatformOperations/pages/169411096"
}