{
  "title": "Lockbox Investigations",
  "id": "169411804",
  "content": "<h2>Overview</h2><p>Gusto has a mailing address to receive physical paper checks. This Gusto lockbox is owned by accounting, confluence <a href=\"https://gustohq.atlassian.net/wiki/display/ACCTG/Corporate+Lockbox\">Corporate Lockbox</a>, but requires support from Payment Operations to investigate&nbsp;wether the check represents customer cash or corporate cash.</p><h2>Procedures</h2><p>Accounting will create a PAYMENTS Jira with the check image and ask to confirm if this is customer cash related. Some common types of tickets include child support garnishment refunds, tax refund checks from different agencies, recovery cases, etc. You can also check the Lockbox transfers on the <a href=\"https://docs.google.com/spreadsheets/d/1strEVQHrlVR4Xv8mGLA1dmYVavZ5Wx10g8e_MsooXSA/edit#gid=923505850\">Treasury Tracker sheet</a> to look up the amount and JIRA as well once Jecah confirms with My that she can transfer the funds.&nbsp;<br /><br /><br /><strong>Child Support Garnishment Tickets</strong></p><ul><li>example: <a href=\"https://gustohq.atlassian.net/browse/PAYMENTS-21815\">https://gustohq.atlassian.net/browse/PAYMENTS-21815</a>&nbsp;<ul><li>These types of tickets will consist of multiple checks. We typically get refund checks from NJFSPC which is a New Jersey Child Support agency.&nbsp;</li><li>The check will typically display the last name of the EE. In this case, you can see it was for &quot;Vargas&quot;</li><li>In order to look up the associated child support garsnishment, you can use the Agent Payment page and filter under &quot;NJ - New Jersey Office of Child Support&quot; and the amount</li><li>You'll look at the date the child support garnishment was sent out and locate the relevant payment and nacha entry</li><li>Once you're able to locate the relevant nacha entry(ies), you can link them on the ticket and let Jecah know she can transfer the funds to our Ops account.</li><li>Jecah will then tag My from Treasury to transfer the funds to our Ops account. This is typically sent into our PNC Ops account.</li><li>You'll see the relevant bank transaction in a few days once treasury completes the transfer.&nbsp;</li><li>Once the bank transaction comes through, you'll use the relevant child support garnishment nacha entry to reconcile the funds via the Repayment Reporter tool.</li></ul></li></ul><p><strong>Recovery Cases&nbsp;</strong></p><ul><li>example: <a href=\"https://gustohq.atlassian.net/browse/PAYMENTS-21810\">https://gustohq.atlassian.net/browse/PAYMENTS-21810</a><ul><li>An indicator that this is a check for a recovery case is that our Chase Recovery account number (ending in x9803) is shown on the check image in this ticket titled &quot;Please Post to Account: x9803)</li><li>Look up the relevant company and see if there's any recovery cases/PIs</li><li>Once you locate the relevant recovery case, link it in the ticket and let Jecah know that this is for a recovery case for an invoice/etc. My will transfer the funds once Jecah lets her know to transfer the funds to the Ops account</li><li>Once the bank transaction comes through, you'll use the relevant failed invoice nacha entry(ies) to reconcile the funds via the Repayment Reporter tool.</li></ul></li></ul><p><br /></p><p><strong>The above tickets are easily identifiable as customer cash, however some tickets do require some extensive research before determining if it's indeed customer cash or not.&nbsp;</strong><br /><br />Examples of tickets that are not customer cash:</p><ul><li><a href=\"https://gustohq.atlassian.net/browse/PAYMENTS-21251\">https://gustohq.atlassian.net/browse/PAYMENTS-21251</a><ul><li>You'll notice that there's no identifiable information on which customer this refund check from NY was sent for such as EIN and company name</li><li>The check also states the payable is to Gusto, Inc (or sometimes ZenPayroll).&nbsp;</li><li>Please verify with the Tax Ops team to see if it was sent on behalf of ZenPayroll/Gusto taxes, or if it belongs to a company on our platform. In this case, my hunch was that it was NOT customer cash because the payable was to Gusto Inc, and the memo was for ACCOUNTS RECEIVABLE ASSESSMENT PAYMENT REFUND.</li><li>Once I <a href=\"https://gustohq.slack.com/archives/CCHQQ7YBH/p1704313228493629\"> surfaced this </a>to Tax Ops, they were able to investigate and confirm that this was for corporate cash.</li><li>Inform Jecah that this is not customer cash and there is no need to transfer the funds.</li></ul></li></ul><ul><li><a href=\"https://gustohq.atlassian.net/browse/PAYMENTS-20893\">https://gustohq.atlassian.net/browse/PAYMENTS-20893</a><ul><li>This check was easily identifiable as taxes filed for ZenPayroll since there's no customer EIN/company name information. I informed Jecah that these were not related to customer cash&nbsp;</li></ul></li></ul><p><br /></p><p><br /></p>",
  "url": "https://gustohq.atlassian.net/wiki/spaces/PlatformOperations/pages/169411804"
}